package test_data

val testTextArray = arrayOf(
    "“因为我被人打了。”面对姐姐的询问，苏木不敢不答，一边答还一边偷偷打量着苏颜。\n" +
            "　　后者脸蛋清冷：“为什么会被人打？”\n" +
            "\n" +
            "　　“技不如人……”苏木脑袋低了一些。\n" +
            "\n" +
            "　　“为什么技不如人？”苏颜盘根问底。\n" +
            "\n" +
            "　　苏木焉巴巴地答道：“没好好修炼。”\n" +
            "\n" +
            "　　苏颜微微点头：“还有点自知之明！知道以后要怎么做了么？”\n" +
            "\n" +
            "　　“知道了。”\n" +
            "\n" +
            "　　“记住你今天的话，若日后还敢贪玩，打你的就不是别人了，会是我亲自动手。”\n" +
            "\n" +
            "　　苏木面色一变，连连保证定会努力修炼，不辜负姐姐的一番期望。\n" +
            "\n" +
            "　　教训完苏木，苏颜才抬起头来看着他身后的众人，美眸扫过，定格在杨开身上，眼中闪过一丝诧异的神色，开口道：“就是你把成少峰给打了？”\n" +
            "\n" +
            "　　杨开暗道这位师姐的消息好灵通，待在这里修炼竟然也知道外面发生的事，微微点头道：“是。”\n" +
            "\n" +
            "　　“比苏木有出息些。”苏颜也没太在意，杨开看起来不大，可也有十五六了，到如今才淬体境八层，资质应该不是太好，自然入不了她的法眼，能与杨开说上一句话，也是看在他救过苏木的份上。\n" +
            "\n" +
            "　　“给你个忠告。”\n" +
            "\n" +
            "　　“师姐请讲。”杨开神色平淡。\n" +
            "\n" +
            "　　“离苏木远些，再跟他待在一起，你的成就也就到此为止了。”\n" +
            "\n" +
            "　　杨开微微一笑，并未答话，她可以贬低苏木，但杨开不能。\n" +
            "\n" +
            "　　苏木一听这话，脸色立马苦了起来，却又不敢出声。\n" +
            "\n" +
            "　　“出去吧，我要修炼了。”苏颜说完便又闭上了眼睛。\n" +
            "\n" +
            "　　一群人轻手轻脚地退出，关上了房门。互相望了一眼，皆都不由自主地喘了口大气，待在里面的压力太大了，虽然美人看起来赏心悦目，但时间久了怕是连身心都会被冰封掉。\n" +
            "\n" +
            "　　“我去看看前些日子让人炼的丹药怎么样了。”李云天说了一声，便告辞离去。\n" +
            "\n" +
            "　　“我也要去。”有几人连忙跟上。\n" +
            "\n" +
            "　　不多时，众人皆都散开，各自有各自的事情，只剩下苏木和杨开两人了。\n" +
            "\n" +
            "　　杨开见苏木好像也有事，微笑一声：“师弟自己忙去吧，我在这里转转。”\n" +
            "\n" +
            "　　苏木点头道：“行，要是看上什么东西跟我说一声，我帮你把把关，这里的人虽然大多数都还不错，可依然有些人奸诈无比，莫要被人当冤大头给宰了。”\n" +
            "\n" +
            "　　和苏木分开之后，杨开便随意在黑风贸市中走动起来。\n" +
            "\n" +
            "　　这里的三派弟子都是随地而坐，面前摆开摊位，放置着自己要出售的东西或者打出招牌，写上自己要买的东西。\n" +
            "\n" +
            "　　摊主们形态各异，有的大声吆喝，如菜市场的菜贩子，热情洋溢地推销自己的货物，有的神态倨傲，摆出一副你爱买不买的样子，故作姿态来引人上钩，还有人闲着无聊，竟就地修炼，也不怕自己的货物被人顺手牵羊，种种模样，不一而足。\n" +
            "\n" +
            "　　走了一会功夫，杨开发现这里的摊位不单单只是卖东西和买东西，还有一些低级炼丹师打出招牌替人炼丹，并且分文不收。\n" +
            "\n" +
            "　　莫以为他们是在做什么好事，其实他们只是需要用别人的材料来练手而已，这些人炼丹，因为经验不足，十炉有八炉是坏的，所以这些摊位前比较清冷。\n" +
            "\n" +
            "　　只不过这种摊位数量不多，炼丹师毕竟比较稀少。\n" +
            "\n" +
            "　　杨开一直在留意阳属性的东西，其实在还没进这个黑风贸市的时候，他胸口处的阳源印就有反应了，杂乱的反应显示这边的阳属性宝贝数量很多。\n" +
            "\n" +
            "　　但这一路走下来，杨开发现许多东西档次都比较低，那些草药中蕴藏的阳气，还没有困龙涧里溢出的浓郁，对于这些他自然是看不上眼的。\n" +
            "\n" +
            "　　他也看上了好几样东西，可去问了问价钱之后，也只能摇头叹息不止。要价太高了，可不是现在的他能够承受的。\n" +
            "\n" +
            "　　转了半个时辰后，杨开一无所获，倒是小回元丹的价格被他给摸透了。\n" +
            "\n" +
            "　　因为小回元丹只针对淬体境七层到九层的武者，所以这种丹药一粒大概也只值五十两左右。\n" +
            "\n" +
            "　　苏木给他的那一瓶有十粒丹药，也就是价值大概在五百两的样子。\n" +
            "\n" +
            "　　五百两，真不够干什么事啊。\n" +
            "\n" +
            "　　面前这个摊位上有一块火红色的石头，杨开可以清楚地感受到其中的炎热阳气，比困龙涧下方溢出的不知要浓郁多少倍，杨开估摸着如果自己吸收了这块石头里的阳气，至少也可以凝练出两三滴阳液来，这可相当于好多日子的苦修了。\n" +
            "\n" +
            "　　纵然知道面前这个看上不太好相处的摊主肯定要价不低，杨开还是不死心地在他面前蹲了下来。\n" +
            "\n" +
            "　　摊主冷着脸，仿佛谁欠了他钱似的，只是打量了一眼杨开便没再理会他。\n" +
            "\n" +
            "　　杨开装模作样地拿起其他几个东西问了问价钱，摊主惜字如金，随口作答，UU看书wwｗ.uｕkanｓhu.ｃom随即杨开仿佛不经意间拿起那一块火红色的石头问道：“这个多少钱？”\n" +
            "\n" +
            "　　摊主冷笑一声，这次倒是多说了几个字：“这是摊子上最贵的东西，三千两。”\n" +
            "\n" +
            "　　杨开彻底没想法了，这完全是漫天要价啊，要价和自己的底线相差太多，还怎么谈？\n" +
            "\n" +
            "　　放下东西正要起身，杨开的肩膀却被人拍了一下，扭头一看，正见到一个千娇百媚的女子对自己微笑。\n" +
            "\n" +
            "　　“真的是你呀。”胡媚儿颇有些意外。\n" +
            "\n" +
            "　　“有事？”杨开眉头皱了皱，说实话，他对这个有些放荡的女子并没什么好感。虽然她现在穿的蛮整齐，可那一日的放肆已经给杨开留下了不好的印象。\n" +
            "\n" +
            "　　察觉出杨开的冷淡，胡媚儿嗔了他一眼，娇声道：“没事呀，过来跟你打个招呼而已。”\n" +
            "\n" +
            "　　“恩，告辞！”杨开淡淡地应了一声，转头就走。\n" +
            "\n" +
            "　　“喂……”胡媚儿紧紧跟上，与杨开一同前进，有意无意地娇弱的身子还贴了上来，一边走一边打量着杨开的反应。\n" +
            "\n" +
            "　　走了一炷香时间，杨开有些郁闷了，他发现这女人不止风骚，脸皮也厚，自己摆明了不愿搭理她，她竟然一直不肯离去。\n" +
            "\n" +
            "　　“你跟着我干什么？”杨开顿住步伐，有些不乐意了。\n" +
            "\n" +
            "　　“没有跟着你呀，这里是黑风贸市，我随便走走逛逛，怎么了，你很在意我么？”胡媚儿娇笑不已。\n" +
            "\n" +
            "　　“别再跟着我，小心我对你不客气。”杨开怒了。\n" +
            "\n" +
            "　　胡媚儿不但不怕，反而还有些跃跃欲试：“怎么个不客气法？象上次那样么？”"
)